import { Markup } from "telegraf";


export const PRICES = {
  PHOTO_ANIMATION: 80,
  MUSIC_CREATION: 165,
  PHOTO_RESTORATION: 35,
  PHOTO_COLORIZE: 35,
  DED_MOROZ: 200,
};

export const mainMenuKeyboard = [
  [Markup.button.callback('🎅 Поздравление Д.Мороза', 'ded_moroz')],
  [
    Markup.button.callback('📸 Оживить фото', 'photo_animation'),
    Markup.button.callback('🎶 Создать музыку', 'music_creation')
  ],
  [
    Markup.button.callback('✨ Реставрировать фото', 'photo_restoration'),
    Markup.button.callback('🎨 ч/б в цветное фото', 'photo_colorize')
  ],
  [Markup.button.callback('Написать в поддержку', 'support')],
  [Markup.button.callback('Личный кабинет', 'profile')]
]

export const getDedMorozMessage = (balance: number) => `
🎅 Хотите личное видео-поздравление от Деда Мороза на своём фото? 

Вот как подарить самые тёплые новогодние пожелания:

1️⃣ Нажмите ниже кнопку - «🎅Поздравление Д.Мороза»
2️⃣ Отправьте одну фотографию* в бот (любую — квартиры или офиса)
3️⃣ Немного подождите — примерно через 3 минуты бот отправит готовое фото с Дедом Морозом ❄️✨
4️⃣ Нажмите кнопку подтвердить и напишите промт по нашему примеру, что именно должен сказать Дед Мороз. 
5️⃣ Немного подождите — бот отправит готовое видео, где Дед Мороз лично поздравит вашего ребёнка 🎬❄️❤️

🔄 Если фото с Дедом Морозом не понравилось — вы можете нажать кнопку повторить и сгенерировать ещё до 2-х раз (всего 3 попытки). Мы хотим, чтобы поздравление было идеальным! ✨

<blockquote>💰 Ваш баланс: ${balance.toFixed(2)} ₽
 📹 Генерация 1 поздравления = ${PRICES.DED_MOROZ}₽</blockquote>

❗️* - бот генерирует только одно фото и видео за раз☝🏻`.trim()

export const dedMorozStartMessage =`
📸 Пример ⤴️


Отправьте фотографию — бот добавит на нее Деда Мороза ✨🎬`.trim()

export const DED_MOROZ_INSTRUCTION = `
<b>🎬 Видео-инструкция по генерации фото/видео с Дедом Морозом</b>

Смотрите короткое видео, чтобы правильно и качественно выполнять шаги и получать потрясающие результаты ✨📸`.trim()